#print - функция, в скобках () 2 аргумента, первый аргумент является строка, а вторым арифметическое выражение
print('2+2 равно', 2 + 2)


# 7 ОСНОВНЫХ ОПЕРАЦИЙ С ЧИСЛАМИ

#Возведение в степень **
# 5 ** 2 == 25
print("52 ** 52 =", 52 ** 52)
#Умножение *
# 2 * 3 == 6
print("52 * 52 =", 52 * 52)

#Деление /
# 14 / 3 == 4.666666666666667
print("52 / 52 =", 52 / 52)

#Целочисленное деление //
# 14 // 3 == 4
print("52 // 12 =", 52 // 12)

#Остаток от деления %
# 14 % 3 == 2
print("52 % 32 =", 52 % 32)

#Сложение +
# 1 + 2 == 3
print(1 + 2)

#Вычитание -
# 4 - 3 == 1
print(4 - 3)


#Тренировка
print('Красота - в глазах смотрящего')
print("             Оскар Уайлд")
print("Мельник Александр", "родился", "12.01.2004")