# Булевы выражения True/False

a = 6
b = 7
c = 42
print(1, a == 6)
print(2, a == 7)
print(3, a == 6 and b == 7)
print(4, a == 7 and b == 7)
print(5, not a == 7 and b == 7)
print(6, a == 7 or b == 7)
print(7, a == 7 or b == 6)
print(8, not (a == 7 and b == 7))
print(9, not a == 7 and b == 6)

# В Python False также можно записать как О, а True - как 1.

#########################################
# выражение ############### результат ###
# истинно and истинно ####### истинно ###
# истинно and ложно ######### ложно #####
# ложно and истинно ######### ложно #####
# ложно and ложно ########### ложно #####
#########################################
# not истинно ############### ложно #####
# not ложно ################# истинно ###
#########################################
# истинно or истинно ####### истинно ####
# истинно or ложно ######### истинно ####
# ложно or истинно ######### истинно ####
# ложно or ложно ########### ложно ######
#########################################


list = ["life", 'Universal', 'Cat', 'Butterfly', 'Cat', 'Handsome']

copy = list[:]
copy.sort()
prev = copy[0]
del copy[0]

count = 0

while count < len(copy) and copy[count] != prev:
    prev = copy[count]
    count = count + 1

if count < len(copy):
    print("Первый дубликат: ", prev)


# Булевы выражения можно использовать,
# когда нужно проверить два или более разных условий одновременно

############################################
# Правда ################## Ложь ###########
############################################
# Правда ################## Ложь ############
# 1 ######################## 0 ##############
# Числа отличные от 0 #### Строка "None" ###
# Непустые строки ######## Пустые строки ###
# Непустые списки ######## Пустые списки ###
# Непустые словари ####### Пустые словари ##
#############################################
